#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: @Nishinoyama, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_disk.k8s-router-disk[0]: Refreshing state... [id=113501301078]
sakuracloud_internet.k8s-external-switch: Refreshing state... [id=113501301081]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113501301072]
sakuracloud_disk.k8s-rook-disk[0]: Refreshing state... [id=113501301080]
sakuracloud_disk.k8s-rook-disk[1]: Refreshing state... [id=113501301079]
sakuracloud_switch.k8s-internal-switch: Refreshing state... [id=113501301070]
sakuracloud_disk.k8s-rook-disk[2]: Refreshing state... [id=113501301074]
data.sakuracloud_archive.ubuntu-archive: Reading...
data.sakuracloud_archive.ubuntu-archive: Read complete after 1s [id=113402076881]
sakuracloud_disk.k8s-lb-disk[1]: Refreshing state... [id=113501301071]
sakuracloud_disk.k8s-node-disk[2]: Refreshing state... [id=113501301073]
sakuracloud_disk.k8s-lb-disk[0]: Refreshing state... [id=113501301076]
sakuracloud_disk.k8s-master-disk[1]: Refreshing state... [id=113501301084]
sakuracloud_disk.k8s-node-disk[0]: Refreshing state... [id=113501301077]
sakuracloud_disk.k8s-node-disk[1]: Refreshing state... [id=113501301075]
sakuracloud_disk.k8s-master-disk[2]: Refreshing state... [id=113501301085]
sakuracloud_disk.k8s-master-disk[0]: Refreshing state... [id=113501301086]
sakuracloud_server.k8s-router[0]: Refreshing state... [id=113501301089]
sakuracloud_server.k8s-lb-server[1]: Refreshing state... [id=113501301110]
sakuracloud_server.k8s-master-server[0]: Refreshing state... [id=113501301114]
sakuracloud_subnet.bgp-subnet: Refreshing state... [id=14986]
sakuracloud_server.k8s-lb-server[0]: Refreshing state... [id=113501301113]
sakuracloud_server.k8s-master-server[2]: Refreshing state... [id=113501301109]
sakuracloud_server.k8s-node-server[1]: Refreshing state... [id=113501301119]
sakuracloud_server.k8s-node-server[0]: Refreshing state... [id=113501301120]
sakuracloud_server.k8s-master-server[1]: Refreshing state... [id=113501301112]
sakuracloud_server.k8s-node-server[2]: Refreshing state... [id=113501301124]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s-lb-disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s-lb-disk" {
      ~ id                = "113501301076" -> (known after apply)
        name              = "k8s-lb-1-dev"
      ~ server_id         = "113501301113" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-lb-disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s-lb-disk" {
      ~ id                = "113501301071" -> (known after apply)
        name              = "k8s-lb-2-dev"
      ~ server_id         = "113501301110" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-master-disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s-master-disk" {
      ~ id                = "113501301086" -> (known after apply)
        name              = "k8s-master-1-dev"
      ~ server_id         = "113501301114" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-master-disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s-master-disk" {
      ~ id                = "113501301084" -> (known after apply)
        name              = "k8s-master-2-dev"
      ~ server_id         = "113501301112" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-master-disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s-master-disk" {
      ~ id                = "113501301085" -> (known after apply)
        name              = "k8s-master-3-dev"
      ~ server_id         = "113501301109" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-node-disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s-node-disk" {
      ~ id                = "113501301077" -> (known after apply)
        name              = "k8s-node-1-dev"
      ~ server_id         = "113501301120" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-node-disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s-node-disk" {
      ~ id                = "113501301075" -> (known after apply)
        name              = "k8s-node-2-dev"
      ~ server_id         = "113501301119" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s-node-disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s-node-disk" {
      ~ id                = "113501301073" -> (known after apply)
        name              = "k8s-node-3-dev"
      ~ server_id         = "113501301124" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s-lb-server[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-lb-server" {
      ~ disks            = [
          - "113501301076",
        ] -> (known after apply)
        id               = "113501301113"
        name             = "k8s-lb-1-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-lb-server[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-lb-server" {
      ~ disks            = [
          - "113501301071",
        ] -> (known after apply)
        id               = "113501301110"
        name             = "k8s-lb-2-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-master-server[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-master-server" {
      ~ disks            = [
          - "113501301086",
        ] -> (known after apply)
        id               = "113501301114"
        name             = "k8s-master-1-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-master-server[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-master-server" {
      ~ disks            = [
          - "113501301084",
        ] -> (known after apply)
        id               = "113501301112"
        name             = "k8s-master-2-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-master-server[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-master-server" {
      ~ disks            = [
          - "113501301085",
        ] -> (known after apply)
        id               = "113501301109"
        name             = "k8s-master-3-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-node-server[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-node-server" {
      ~ disks            = [
          - "113501301077",
          - "113501301080",
        ] -> (known after apply)
        id               = "113501301120"
        name             = "k8s-node-1-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-node-server[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-node-server" {
      ~ disks            = [
          - "113501301075",
          - "113501301079",
        ] -> (known after apply)
        id               = "113501301119"
        name             = "k8s-node-2-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s-node-server[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s-node-server" {
      ~ disks            = [
          - "113501301073",
          - "113501301074",
        ] -> (known after apply)
        id               = "113501301124"
        name             = "k8s-node-3-server-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 8 to add, 8 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>